{
  "radionice": [
    {
      "id": "radionica_1",
      "ime": "Znanost superjunaka",
      "cover": "./public/images/courses/fizika.jpg",
      "datum": "01.01.2025",
      "predavac": "predavac_1",
      "opis": "Tečaj za superjunaka je intenzivni program obuke koji uči polaznike kako postati heroji, od borilačkih vještina do upravljanja moćima, pružajući im sve potrebne alate za spašavanje svijeta. Kroz simulirane misije i vježbe, tečaj priprema buduće junake za suočavanje s najtežim izazovima i donošenje pravilnih odluka u kritičnim situacijama.",
      "broj_prijava": 0,
      "tezina": "Mid",
      "tema": ["Znanost"]
    },
    {
      "id": "radionica_2",
      "ime": "Anatomija jednoroga ",
      "cover": "./public/images/courses/magija.jpg",
      "datum": "01.01.2025",
      "predavac": "predavac_2",
      "opis": "Tečaj anatomije jednoroga pruža temeljito razumijevanje unikatne građe i funkcija ovog mitskog stvorenja, istražujući sve od strukture rogova do unutarnjih organa. Polaznici će imati priliku produbiti svoje znanje o biologiji jednoroga i razviti sposobnosti za rad s tim čarobnim bićem u različitim kontekstima.",
      "broj_prijava": 0,
      "tezina": "Senior",
      "tema": ["Magija"]
    },
    {
      "id": "radionica_3",
      "ime": "Gradnja kule od karata",
      "cover": "./public/images/courses/gradnja.jpg",
      "datum": "01.01.2025",
      "predavac": "predavac_3",
      "opis": "Tečaj gradnje kule od karata pruža polaznicima priliku da nauče temeljne principe i tehnike potrebne za izgradnju visokih i stabilnih struktura od karata. Kroz praktične vježbe i savladavanje izazova, polaznici će razviti svoje vještine u konstrukciji i ojačati svoje razumijevanje fizike i inženjeringa.",
      "broj_prijava": 0,
      "tezina": "Senior",
      "tema": ["Znanost", "Magija"]
    },
    {
      "id": "radionica_4",
      "ime": "Zombi apokalipsa",
      "cover": "./public/images/courses/kemija.jpg",
      "datum": "01.01.2025",
      "predavac": "predavac_4",
      "opis": "Tečaj za zombi apokalipsu je intenzivni program koji polaznike uči svim potrebnim vještinama za preživljavanje i borbu u svijetu opustošenom zombijima, uključujući taktičko planiranje, samoodbranu i resursno upravljanje. Kroz simulirane scenarije i praktične vježbe, polaznici će biti pripremljeni za suočavanje s ekstremnim situacijama i osposobljeni za zaštitu sebe i drugih u slučaju zombi napada.",
      "broj_prijava": 0,
      "tezina": "Junior",
      "tema": ["Programiranje", "Magija"]
    },
    {
      "id": "radionica_5",
      "ime": "Umjetnost prokrastinacije",
      "cover": "./public/images/courses/hakiranje.jpg",
      "datum": "01.01.2025",
      "predavac": "predavac_5",
      "opis": "Tečaj za prokrastinaciju je program koji pomaže polaznicima razumjeti korijene i posljedice odgađanja te ih uči strategijama za prevladavanje navike odgađanja i povećanje produktivnosti. Kroz interaktivne radionice i tehnike upravljanja vremenom, polaznici će naučiti kako efikasno planirati i izvršavati zadatke bez nepotrebnog odlaganja.",
      "broj_prijava": 0,
      "tezina": "Mid",
      "tema": ["Programiranje"]
    },
    {
      "id": "radionica_6",
      "ime": "Uvod u NLO sociologiju",
      "cover": "./public/images/courses/robotika.jpg",
      "datum": "01.01.2025",
      "predavac": "predavac_6",
      "opis": "Tečaj za NLO sociologiju je program koji istražuje fenomene povezane s izvanzemaljskim kontaktima i njihovim utjecajem na ljudsko društvo, pružajući polaznicima uvid u sociološke perspektive, teorije i prakse vezane uz ovu temu. Kroz analizu iskustava, vjerovanja i društvenih reakcija na navodne NLO pojave, polaznici će razumjeti kompleksnost interakcije između ljudi i mogućih vanzemaljskih entiteta.",
      "broj_prijava": 0,
      "tezina": "Senior",
      "tema": ["Znanost", "Programiranje"]
    }
  ],
  "predavaci": [
    {
      "id": "predavac_1",
      "ime": "Dr. Robert Lee",
      "cover": "./public/images/teachers/einstein.jpg",
      "biografija": "Iskusan edukator fizike s doktoratom sa MIT-a. S desetljećem iskustva u podučavanju, Dr. Lee je poznat po svojoj sposobnosti da kompleksne koncepte fizike učini relevantnima i zanimljivima za studente. Kroz svoje inovativne metode podučavanja i nepokolebljivu predanost, on inspirira novu generaciju budućih znanstvenika da istraže čuda svemira.",
      "organizacija": "Institut Max Planck",
      "tema": ["Znanost", "Programiranje"]
    },
    {
      "id": "predavac_2",
      "ime": "Luna Blackwood",
      "cover": "./public/images/teachers/granger.jpg",
      "biografija": "Instruktorica magije s godinama iskustva u mističnim umjetnostima. Sa pozadinom u drevnim arkanim studijima i suvremenom čarolijom, profesorica Blackwood donosi jedinstvenu kombinaciju tradicije i inovacije u svoje podučavanje. Kroz svoje očaravajuće lekcije i interaktivne demonstracije, inspirira svoje studente da otključaju tajne magije i krenu na vlastita čarobna putovanja.",
      "organizacija": "Akademija Hogwarts",
      "tema": ["Magija"]
    },
    {
      "id": "predavac_3",
      "ime": "David Martinez",
      "cover": "./public/images/teachers/strojar.jpg",
      "biografija": "Iskusni edukator u inženjeringu s magisterijem iz strojarstva na Stanford Universityju. S desetljećem iskustva u podučavanju, profesor Martinez poznat je po dinamičnom pristupu podučavanju, integrirajući stvarne primjene i praktične projekte u svoj kurikulum. Posvećen je osnaživanju svojih studenata vještinama i znanjem koje im je potrebno kako bi se istaknuli u području inženjeringa.",
      "organizacija": "Fakultet Ulica",
      "tema": ["Znanost"]
    },
    {
      "id": "predavac_4",
      "ime": "Nina Chronos",
      "cover": "./public/images/teachers/chemist.jpg",
      "biografija": "Zaputite se u učionicu profesorice Chronos, edukatora koji putuje kroz vrijeme s doktoratom iz Temporalne mehanike. Sa tisućljećima iskustva u podučavanju koje se proteže kroz epohe, profesorica Chronos besprijekorno isprepliće povijest i proučavanje budućnosti u svojim lekcijama. Kroz svoj inovativni pristup, ona vodi studente na izazovno putovanje kroz vrijeme, inspirirajući ih da istraže prošlost, sadašnjost i budućnost.",
      "organizacija": "Akademija Hogwarts",
      "tema": ["Znanost", "Magija"]
    },
    {
      "id": "predavac_5",
      "ime": "Alan Smith",
      "cover": "./public/images/teachers/hacker.jpg",
      "biografija": "Upoznajte profesora Alana Smitha, računalnog genija i pionira u području računalne znanosti. S bogatim iskustvom u industriji i vještinom rješavanja složenih problema, profesor Smith donosi dinamičan pristup podučavanju. Njegova strast prema tehnologiji i predanost inovacijama osnažuju studente da se istaknu u uvijek mijenjajućem svijetu računarstva.",
      "organizacija": "Fakultet Ulica",
      "tema": ["Programiranje"]
    },
    {
      "id": "predavac_6",
      "ime": "Dr. Samantha Styx",
      "cover": "./public/images/teachers/roboto.jpg",
      "biografija": "Cijenjena profesorica robotike, ima doktorat iz robotičkog inženjerstva s MIT-a. Sa više od desetljeća iskustva u području, Dr. Styx je poznata po svojem revolucionarnom istraživanju umjetne inteligencije, humanoidne robotike i autonomnih sustava. Kroz svoje inovativne metode podučavanja i mentorski rad, inspirira studente da dosegnu granice robotike i oblikuju budućnost tehnologije.",
      "organizacija": "Institut Max Planck",
      "tema": ["Znanost", "Programiranje"]
    }
  ],
  "organizacije": [
    {
      "id": "organizacija_1",
      "ime": "Akademija Hogwarts",
      "opis": "Hogwarts Academy is a prestigious school of witchcraft and wizardry. With its towering turrets, enchanted corridors, and mystical atmosphere, Hogwarts is where young witches and wizards embark on a journey of magical education, learning spells, potions, and the intricacies of the wizarding world while forging lifelong friendships and facing thrilling adventures. Led by esteemed professors and overseen by the wise and enigmatic Headmaster, Hogwarts Academy remains a symbol of magic, knowledge, and the enduring power of friendship.",
      "radionice": ["radionica_1", "radionica_3"]
    },
    {
      "id": "organizacija_2",
      "ime": "Institut Max Planck",
      "opis": "A renowned center of research and innovation at the forefront of scientific discovery. Its interdisciplinary approach, state-of-the-art facilities, and collaborative environment foster groundbreaking research across various scientific disciplines. From fundamental research to practical applications, the Science Institute drives progress, advances knowledge, and addresses complex challenges facing humanity in the modern era.",
      "radionice": ["radionica_2", "radionica_6"]
    },
    {
      "id": "organizacija_3",
      "ime": "Fakultet Ulica",
      "opis": "Streets Faculty is a vibrant institution nestled in the heart of a bustling city, offering a unique blend of academic excellence and real-world experience. With its diverse faculty and dynamic curriculum, Streets Faculty prepares students for success in urban planning, architecture, and community development. Through hands-on projects and partnerships with local organizations, students at Streets Faculty are equipped with the knowledge and skills to positively impact the communities they serve.",
      "radionice": ["radionica_4", "radionica_5"]
    }
  ],
  "tezine": [
    {
      "id": "junior",
      "ime": "Junior"
    },
    {
      "id": "mid",
      "ime": "Mid"
    },
    {
      "id": "senior",
      "ime": "Senior"
    }
  ],
  "teme": [
    {
      "id": "programming",
      "ime": "Programiranje"
    },
    {
      "id": "magic",
      "ime": "Magija"
    },
    {
      "id": "science",
      "ime": "Znanost"
    }
  ]
}
